
#include <iostream>
using namespace std;

int main() {

	// int a = 5;
	// int *b = &a;
	// int &c = a;
	// //int &d = b; ERROR!

	// cout << a << " : " << *b << " : " << c << endl;

	// *b = 25;
	// cout << a << " : " << *b << " : " << c << endl;

	// c = 21;
	// cout << a << " : " << *b << " : " << c << endl;

	int n = 10;
// дефинира и инициализира цяла променлива
int* pn = &n; // дефинира и инициализира указател pn към n
// показва, че указателят сочи към n
cout << "n= " << n << " *pn= " << *pn << '\n';
// показва, че адресът на n е равен на стойността на pn
cout << "&n= "<< &n << " pn= " << pn << '\n';
// намиране на стойността на n чрез pn
int m = *pn;
// m == 10
// промяна на стойността на n чрез pn
*pn = 20;
// извеждане на стойността на n
cout << "n= " << n << '\n'; // n == 20


	return 0;
}