/*
Да се напиша програма коята на цялата променлива k присвоява номера на квадрратнта, 
в които се намират точка с короднитати x, y. Точката не лежи на координатните оси, т.е x,y != 0;

Да се напише задача, кояо извежда Yеs ако точка с координати (х, у) е 
намира в 1 и 3 квадрант (вариант - във 2 или 4 квадрант ) и No в противен случай. 
Точката не лежи на координатните оси, т.е. x, y != 0;
*/

#include <iostream>
using namespace std;

int main () {

	int x, y = 0;
	int k = 0;
	while (x == 0 || y == 0) {
		cout << "Enter x and y with space:";
		cin >> x >> y;
	}

	k = (y > 0) ? ((x > 0) ? k=1 : k=2) : ((x > 0) ? k=4 : k=3);
	cout << k << endl;
	
	return 0;	
}